Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: བཀུར་སྟི་མི་བྱེད་པ་དག་ལ་དང་དུ་ལེན་པ་དང་། བཀུར་སྟི་བྱེད་པ་རྣམས་ལ་ཁེངས་པར་མི་བྱེད་པ་དང་། རྙེད་པ་དང་མ་རྙེད་པ་དང་། གྲགས་པ་དང་མ་གྲགས་པ་དང་། སྨད་པ་དང་བསྔགས་པ་དང་། བདེ་བ་དང་སྡུག་བསྔལ་བ་དག་ལ་ཁེངས་པར་ཡང་མི་འགྱུར། ཞུམ་པར་ཡང་མི་འགྱུར་བ་དང་།
en: to be tolerant of those who are disrespectful; and not to become full of oneself when people are respectful, nor arrogant or discouraged when meeting with gain or loss, fame or disrepute, praise or slander, pleasure or pain.

source: རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤོང་བ་དང་།
en: “It is to give up attachment and anger;

source: ཁོན་དུ་མི་འཛིན་པ་དང་།
en: not to hold grudges;

source: རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བྱམས་པ་ལ་གནས་པ་དང་།
en: to stay loving at all times without ever stopping;

source: མཛའ་བཤེས་དང་དགྲ་རྣམས་ལ་སེམས་སྙོམས་པར་ལྟ་བ་དང་།
en: to keep an impartial attitude toward both friends and enemies;

source: ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་མཆོག་ཏུ་མི་འཛིན་པ་དང་།
en: not to cling to the component of discipline as supreme;

source: ཐེག་པ་གཞན་དུ་ཡོངས་སུ་མི་སྔོ་བ་དང་།
en: not to dedicate one’s merit toward other vehicles;

source: ལྷ་གཞན་ལ་ཕྱག་མི་འཚལ་བ་དང་།
en: not to pay homage to other gods;

source: ལྟ་བར་གྱུར་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་།
en: to be free of any type of view;

source: བག་ལ་ཉལ་དང་ཀུན་ནས་ལྡང་བ་རྣམ་པར་གནོན་པ་དང་།
en: to quell both latent and manifest afflictions;

source: འགྱོད་པ་སྤོང་བ་དང་།
en: to give up regret;

source: ཡིད་ལ་གཅགས་པ་མེད་པ་དང་།
en: to be free of remorse;

source: དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ལ་མཆོག་ཏུ་དགའ་བ་དང་།
en: to delight in giving everything away;

source: སྐྱེ་བའི་གནས་ཐམས་ཅད་ལ་ལྷག་པར་ཆགས་པ་མེད་པ་དང་།
en: to be free from attachment to any mode of birth;

source: བསམས་བཞིན་དུ་སྲིད་པའི་འགྲོ་བར་སྐྱེ་བ་དང་།
en: to take rebirth in existence intentionally;

source: མི་དགའ་བ་བཟོད་པ་དང་།
en: to be tolerant of the unpleasant;

source: བརྩོན་འགྲུས་རྩོམ་པ་དང་།
en: to apply diligence;

source: སེམས་རབ་ཏུ་འཛིན་པ་དང་།
en: to take hold of the mind;

source: དམིགས་པ་ལ་རྣམ་པར་གཡེངས་པ་མེད་པ་དང་།
en: to be undistracted from the object of one’s observation;

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་ཅིང་མི་སྐྲག་པ་སྟེ།
en: to be accepting of and not intimidated by the unborn nature of phenomena.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ཡིན་ཏེ།
en: Son of noble family, such is the bodhisattvas’ accumulation of discipline.

source: ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་དེ་ལ་བརྟེན་ནས་སྲོག་གི་ཕྱིར་ཡང་བསླབ་པ་ཉམས་པར་མི་བྱེད་དེ།
en: “With this accumulation of discipline as a foundation, they do not lapse in their training, even if it costs them their lives.

source: དེ་ནི་རྒྱལ་སྲིད་ཀྱི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: They do not maintain discipline for the sake of gaining political authority.

source: མཐོ་རིས་ཀྱི་ཕྱིར་མ་ཡིན། བརྒྱ་བྱིན་དུ་འགྱུར་བའི་ཕྱིར་མ་ཡིན། ཚངས་པར་འགྱུར་བའི་ཕྱིར་མ་ཡིན།
en: They do not maintain discipline to reach the higher realms, the state of Śakra, or the state of Brahmā;

source: ལོངས་སྤྱོད་ཀྱི་ཕྱིར་མ་ཡིན། དབང་ཕྱུག་གི་ཕྱིར་མ་ཡིན། ཁ་དོག་གི་ཕྱིར་མ་ཡིན། གྲགས་པའི་ཕྱིར་མ་ཡིན། སྙན་པ་དང་སྒྲ་དང་ཚིགས་སུ་བཅད་པའི་ཕྱིར་མ་ཡིན།
en: not for wealth, not for power, not for caste, not for fame, not for renown, acclaim, or to be eulogized;

source: རྙེད་པའི་ཕྱིར་མ་ཡིན། བཀུར་སྟིའི་ཕྱིར་མ་ཡིན། སྲོག་གི་ཕྱིར་མ་ཡིན། གོས་ཀྱི་ཕྱིར་མ་ཡིན། ཟས་ཀྱི་ཕྱིར་མ་ཡིན། མལ་ཆ་དང་སྟན་གྱི་ཕྱིར་མ་ཡིན་ཏེ། ན་བའི་གསོས་དང་། སྨན་ཟོང་གི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: not to gain anything, not to garner respect, not to prolong their lives, not for clothing, not for food, not for bedding or cushions, not to be cured of an ailment, and not for medicines.

source: མིག་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་ལ་རྟེན་ཏེ་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: They do not maintain discipline based on the eyes, ears, nose, tongue, or body.

source: གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་ལ་རྟེན་ཏེ་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: They do not maintain discipline based on form, sound, smell, taste, texture, or mental phenomena.

source: གཟུགས་ལ་རྟེན་ཏེ་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་རྟེན་ཏེ་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: They do not maintain discipline based on form, feeling, perception, formation, or consciousness.

source: འདོད་པའི་ཁམས་ལ་རྟེན་ཏེ་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: “They do not maintain discipline based on the desire realm.

source: གཟུགས་ཀྱི་ཁམས་ལ་རྟེན་ཏེ་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: They do not maintain discipline based on the form realm.

source: གཟུགས་མེད་པའི་ཁམས་ལ་རྟེན་ཏེ་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: They do not maintain discipline based on the formless realm.

source: སེམས་ཅན་དམྱལ་བའི་འཇིགས་པས་སྐྲག་སྟེ།
en: They do not maintain discipline out of fear of becoming a hell being.

source: ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་འཇིགས་པས་སྐྲག་སྟེ་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: They do not maintain discipline out of fear of taking birth as an animal.

source: གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་འཇིགས་པས་སྐྲག་སྟེ་སྐྱབས་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: They do not maintain discipline out of fear of, and to seek a refuge from, the world of the Lord of Death.

source: མི་དབུལ་པོའི་འཇིགས་པས་སྐྲག་སྟེ་ཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དོ། །
en: They do not maintain discipline out of fear of being a poor human being.

source: ལྷ་དབུལ་པོའི་འཇིགས་པས་སྐྲག་པ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དབུལ་པོའི་འཇིགས་པས་སྐྲག་སྟེཚུལ་ཁྲིམས་སྲུང་བར་མི་བྱེད་དེ།
en: They do not maintain discipline out of fear of being a poor god, or being a poor nāga, yakṣa, divine spirit, demigod, garuḍa, kiṃnara, or mahoraga.

source: གཞན་དུ་ན་སངས་རྒྱས་ཀྱི་ཚུལ་གནས་པར་བྱ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: “They do, however, maintain discipline in order to preserve the Buddha’s tradition.

source: སངས་རྒྱས་ཀྱི་རིགས་གནས་པར་བྱ་བ་དང་། ཆོས་ཀྱི་རིགས་གནས་པར་བྱ་བ་དང་། དགེ་འདུན་གྱི་རིགས་གནས་པར་བྱ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: They maintain discipline to preserve the lineage of the Buddha, to preserve the lineage of the Dharma, and to preserve the lineage of the Saṅgha.

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ལས་ཡང་དག་པར་འདའ་བར་བྱ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: They maintain discipline in order to transcend birth, aging, sickness, death, pain, lamentation, suffering, mental dissatisfaction, and strife.

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགྲོལ་བར་འདོད་དེ་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: They maintain discipline out of the wish to liberate all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བ་དང་། གྲུབ་པ་དང་། བདེ་བ་འདོད་དེ་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: They maintain discipline out of the wish to bring aid, happiness, fulfillment, and welfare to all beings.

source: སངས་རྒྱས་ཀྱི་ཆོས་གནས་པར་འདོད་དེ་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: They maintain discipline out of the wish to preserve the Buddha’s teachings.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འདོད་དེ་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: They maintain discipline out of the wish that the wheel of Dharma be turned.

source: འཕགས་པའི་དགེ་འདུན་ཡོངས་སུ་བསྡུ་བར་འདོད་དེ་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: They maintain discipline out of the wish that the Saṅgha of noble ones be assembled.

source: སངས་རྒྱས་ཀྱི་རིགས་མི་འཆད་པར་འདོད་པ་དང་། ཆོས་ཀྱི་རིགས་མི་འཆད་པར་འདོད་པ་དང་། དགེ་འདུན་གྱི་རིགས་མི་འཆད་པར་འདོད་དེ་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: They maintain discipline wishing that the lineage of the Buddha be unbroken, wishing that the lineage of the Dharma be unbroken, and wishing that the lineage of the Saṅgha be unbroken.

source: འཕགས་པའི་རིགས་ཡོངས་སུ་སྤྱད་པར་འདོད་དེ་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །
en: “They maintain discipline out of the wish to participate in the lineage of noble ones.

source: ལྷའི་མངོན་པར་ཤེས་པ་འདོད་པ་དང་། ཏིང་ངེ་འཛིན་འདོད་པ་དང་། ཤེས་རབ་འདོད་པ་དང་། རྣམ་པར་གྲོལ་བ་འདོད་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བར་འདོད་དེ་
en: They maintain discipline out of the wish for divine superknowledge, out of the wish for absorption, out of the wish for insight, out of the wish for liberation, and out of the wish to perceive the wisdom of liberation.

source: ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དོ། །རྫུ་འཕྲུལ་འདོད་པ་དང་། ཆོ་འཕྲུལ་འདོད་དེ་ཚུལ་ཁྲིམས་སྲུང་བར་བྱེད་དེ།
en: They maintain discipline out of the wish for miraculous powers, and out of the wish for magical powers.

source: དེའི་ཚུལ་ཁྲིམས་དེ་ཡང་མ་ཉམས་པ་དང་། མ་ཞིག་པ་དང་། མ་འདྲེས་པ་དང་། མ་འཆོལ་བ་དང་། རང་དབང་ཡོད་པ་དང་། ལེགས་པར་ཚར་ཕྱིན་པ་དང་། ལེགས་པར་བསམས་པ་དང་། མ་ནོགས་པ་དང་། རྨ་མེད་པ་དང་། གཙང་བ་དང་། དྲི་ཞིམ་པ་དང་། མཁས་པས་བསྔགས་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྟོད་པ་དང་། མ་སྨས་པ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་སྒྲུབ་པ་སྙིང་པོར་བྱེད་པ་ཡིན་ནོ། །
en: This type of discipline is unimpaired, undamaged, uncorrupted, undistorted, stable, self-reliant, perfected, well considered, unsullied, unblemished, immaculate, fragrant, extolled by the wise, praised by all buddhas, free of defect, and constitutes the essential spiritual practice in accord with the Dharma.

source: དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དེ་ལྟ་བུ་དང་ལྡན་པས་ཆོས་བཅུ་ལས་ཉམས་པར་མི་འགྱུར་ཏེ།
en: “In possession of this component of discipline, there are ten things from which they will not fall away.

source: བཅུ་གང་ཞེ་ན།
en: What are those ten things?

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ཏེ། དེ་ལ་ཡང་བག་ཡོད་ལ་བྱང་ཆུབ་འདོད་པ་དང་།
en: They will not fall away from the dominion of the wheel-bearing monarch, while at the same time conscientiously striving for awakening.

source: བརྒྱ་བྱིན་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ཏེ། དེ་ལ་ཡང་བག་ཡོད་ལ་བྱང་ཆུབ་འདོད་ཅིང་སངས་རྒྱས་མཐོང་བ་འབའ་ཞིག་འདོད་པ་དང་།
en: They will not fall away from the state of Śakra, while at the same time conscientiously striving for awakening, and wishing only to behold the buddhas.

source: ཚངས་པ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ཏེ། དེ་ལ་ཡང་བག་ཡོད་ལ་བྱང་ཆུབ་འདོད་པ་དང་།
en: They will not fall away from the state of Brahmā, while still conscientiously striving for awakening.

source: ཤེས་ནས་དང་བ་ཐོབ་པའི་ཕྱིར་སངས་རྒྱས་མཐོང་བ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: They will not fall away from beholding the Buddha, as they have attained faith based on understanding.

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་ལ་ནན་ཏན་དུ་བསྒྲུབ་པའི་ཕྱིར་ཆོས་ཐོས་པ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: They will not fall away from hearing the Dharma, as they put the teachings into practice assiduously just as they have learned them.

source: བྱང་ཆུབ་སེམས་དཔའི་དམ་བཅས་པ་ཤེས་པ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: They will not fall away from understanding of the bodhisattva vow.

source: དགེ་བའི་རྩ་བའི་ཆོས་ཐམས་ཅད་ཤེས་པ་འདོད་པའི་ཕྱིར་སྤོབས་པ་མི་ཆོད་པ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: They will not fall away from unabated confidence, as they seek to understand everything with regard to the roots of virtue.

source: བསམ་གཏན་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: They will not fall away from concentration.

source: སངས་རྒྱས་དང་། རང་སངས་རྒྱས་དང་། ཉན་ཐོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བསྔགས་པ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: They will not fall away from being extolled by all the buddhas, solitary buddhas, śrāvakas, and bodhisattvas.

source: མངོན་པར་ཤེས་པ་མྱུར་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་སྟེ།
en: They will not fall away from attaining swift superknowledge and perfecting the wisdom of omniscience.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཆོས་བཅུ་པོ་དེ་དག་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ། །
en: Bodhisattva great beings who possess this component of discipline will not fall away from these ten things.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དེ་ལྟ་བུ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལྷ་རྣམས་ཀྱིས་རྟག་ཏུ་ཕྱག་བྱས་པ་ཡིན་ནོ། །
en: “Bodhisattva great beings who are established in the component of discipline in this way are forever revered by the gods,

source: ཀླུ་རྣམས་ཀྱིས་རྟག་ཏུ་བསྔགས་པ་ཡིན་ནོ། །
en: always extolled by nāgas,

source: གནོད་སྦྱིན་རྣམས་ཀྱིས་རྟག་ཏུ་བཀུར་སྟི་བྱས་པ་ཡིན་ནོ། །
en: perpetually honored by yakṣas,

source: དྲི་ཟ་རྣམས་ཀྱིས་རྟག་ཏུ་མཆོད་པ་ཡིན་ནོ། །
en: always worshipped by gandharvas, and

source: ཀླུའི་དབང་པོ་དང་། ལྷ་མ་ཡིན་རྣམས་ཀྱིས་རྟག་ཏུ་བསྙེན་བཀུར་བྱས་པ་ཡིན་ནོ། །
en: constantly venerated by the lord of nāgas and by demigods.

source: རྒྱལ་རིགས་དང་། བྲམ་ཟེ་དང་། ཚོང་དཔོན་དང་། ཁྱིམ་བདག་རྣམས་ཀྱིས་རྟག་ཏུ་བཀུར་བ་ཡིན་ནོ། །
en: They are always respected by the ruling caste, priests, merchants, and householders.

source: མཁས་པ་རྣམས་ཀྱིས་རྟག་ཏུ་ཐད་དུ་འགྲོ་བར་བྱ་བ་ཡིན་ནོ། །
en: The wise always hasten to their presence.

source: སངས་རྒྱས་རྣམས་ཀྱིས་རྟག་ཏུ་དགོངས་པ་ཡིན་ནོ། །
en: The buddhas always keep them in mind.

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་རྟག་ཏུ་སྟོན་པར་བཀུར་བ་ཡིན་ནོ། །
en: The whole world, including the gods, forever reveres them as teachers.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བ་ཅན་ཡིན་ནོ། །
en: And they have constant love for all beings.

source: དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡང་དག་པར་སྲུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་འགྲོ་བ་བཞིར་འགྲོ་བར་མི་འགྱུར་ཏེ།
en: “Bodhisattva great beings who genuinely uphold the component of discipline in this way will not migrate into four states.

source: བཞི་གང་ཞེ་ན་
en: Which four states?

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཆེད་མ་གཏོགས་པར་མི་ཁོམ་པའི་འགྲོ་བར་འགྲོ་བར་མི་འགྱུར་བ་དང་།
en: They will not migrate to the unfree states, unless it is in order to bring beings to maturity.

source: སངས་རྒྱས་མི་བཞུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་འགྲོ་བར་འགྲོ་བར་མི་འགྱུར་བ་དང་།
en: They will not migrate to states in buddhafields where no buddha dwells.

source: ལོག་པར་ལྟ་བའི་རིགས་སུ་སྐྱེ་བའི་འགྲོ་བར་འགྲོ་བར་མི་འགྱུར་བ་དང་།
en: They will not migrate to states of birth in families that have wrong views.

source: ངན་འགྲོ་ཐམས་ཅད་ཀྱི་འགྲོ་བར་འགྲོ་བར་མི་འགྱུར་བ་སྟེ།
en: They will not migrate to any of the lower states.

source: དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལེགས་པར་ཡང་དག་པར་སྲུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འགྲོ་བ་བཞི་པོ་དེ་དག་ཏུ་འགྲོ་བར་མི་འགྱུར་རོ། །
en: It is thus that bodhisattva great beings who genuinely and properly uphold the component of discipline will not migrate to these four states.

source: གཞན་ཡང་དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡང་དག་པར་སྲུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་བཞི་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ཏེ།
en: “Moreover, bodhisattva great beings who genuinely uphold the component of discipline in this way will not deviate from four things.

source: རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: They will not deviate whatsoever from the mind of complete awakening.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: They will not deviate from recollecting the Buddha.

source: ཇི་ལྟར་ཐོས་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པའི་ཆོས་རྣམས་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: They will not deviate whatsoever from the Dharma, which they have learned and mastered.

source: བསྐལ་པ་གྲངས་མེད་པ་རྗེས་སུ་དྲན་པ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་སྟེ།
en: They will not deviate whatsoever from remembering the incalculable eons.

source: དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡང་དག་པར་སྲུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་བཞི་པོ་དེ་དག་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ། །
en: In this way, bodhisattva great beings who genuinely uphold the component of discipline will not deviate from these four things.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡང་དག་པར་སྲུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པར་འཇིག་པ་བཞི་དང་ཕྲད་པར་མི་འགྱུར་ཏེ།
en: “Furthermore, son of noble family, bodhisattva great beings who genuinely uphold the component of discipline in this way will not end up in four dangers.

source: དམ་པའི་ཆོས་རྣམ་པར་འཇིག་པ་དང་ཕྲད་པར་མི་འགྱུར་བ་དང་།
en: They will not end up in danger related to the sacred Dharma.

source: མཚོན་གྱི་བར་གྱི་བསྐལ་པ་དང་ཕྲད་པར་མི་འགྱུར་བ་དང་།
en: They will not end up in the intermediate eon of weapons.

source: མུ་གེའི་བར་གྱི་བསྐལ་པ་དང་ཕྲད་པར་མི་འགྱུར་བ་དང་།
en: They will not end up in the intermediate eon of famine.

source: ནད་ཀྱི་བར་གྱི་བསྐལ་པ་དང་ཕྲད་པར་མི་འགྱུར་བ་སྟེ།
en: They will not end up in the intermediate eon of disease.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡང་དག་པར་སྲུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པར་འཇིག་པ་བཞི་པོ་དེ་དག་དང་ཕྲད་པར་མི་འགྱུར་རོ། །
en: In this way, son of noble family, the bodhisattva great beings who genuinely uphold the component of discipline will not end up in these four dangers.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མངོན་པར་མཐོ་བ་བཞི་ཐོབ་པར་འགྱུར་ཏེ།
en: “In addition, son of noble family, bodhisattva great beings who abide by the component of discipline in this way will attain four exalted states.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མི་སླུ་བ་དང་།
en: Freedom from deception with regard to the blessed ones, the buddhas;

source: ལྷ་ལ་མི་སླུ་བ་དང་།
en: freedom from deception with regard to gods;

source: སེམས་ཅན་རྣམས་ལ་མི་སླུ་བ་དང་།
en: freedom from deception with regard to sentient beings; and

source: རང་གི་སེམས་ལ་མི་སླུ་བ་སྟེ།
en: freedom from deception with regard to their own mind.

source: དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མངོན་པར་མཐོ་བ་བཞི་པོ་དེ་དག་ཐོབ་པར་འགྱུར་རོ། །
en: Thus will bodhisattva great beings who abide by the component of discipline attain these four exalted states.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འཇིགས་པ་བཅུ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་ཏེ།
en: “Moreover, son of noble family, bodhisattva great beings who abide by the component of discipline in this way will pass genuinely beyond ten dangers.

source: སེམས་ཅན་དམྱལ་བའི་འཇིགས་པ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་དང་།
en: They will pass genuinely beyond the danger of ending up as hell beings.

source: དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་འཇིགས་པ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་དང་།
en: They will pass genuinely beyond the danger of taking birth as animals.

source: གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་འཇིགས་པ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་དང་།
en: They will pass genuinely beyond the danger of the world of the Lord of Death.

source: དབུལ་བའི་འཇིགས་པ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་དང་།
en: They will pass genuinely beyond the danger of being destitute.

source: བསྔགས་པ་དང་། སྙན་པ་དང་། གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་མ་ཡིན་པའི་འཇིགས་པ་དང་།
en: They [will pass genuinely] beyond the danger of not being extolled, renowned, famous, acclaimed, and eulogized.

source: བདུད་ཀྱིས་ཀུན་ནས་དཀྲིས་པའི་འཇིགས་པ་དང་།
en: They [will pass genuinely] beyond the danger of being ensnared by demons.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ངེས་པའི་འཇིགས་པ་དང་།
en: They [will pass genuinely] beyond the danger of the convictions of a śrāvaka or solitary buddha.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། གྲུལ་བུམ་དང་། སྲིན་པོའི་འཇིགས་པ་དང་།
en: They [will pass genuinely] beyond the danger of gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, mahoragas, kumbhāṇḍas, and rākṣasas.

source: དུག་དང་། མཚོན་དང་། མེ་དང་། ཆུའི་འཇིགས་པ་དང་།
en: They [will pass genuinely] beyond dangers related to poison, weapons, fire, and water.

source: སེང་གེ་དང་། སྟག་དང་། སྦྲུལ་དང་། དོམ་དང་། དྲེད་དང་། གཟིག་དང་། ཁྱི་དང་། ཝ་དང་། ཆུ་སྲིན་མ་ཀ་ར་དང་། ཆུ་སྲིན་བྱིས་པ་གསོད་དང་། ཆུ་སྲིན་ཀུམ་བྷི་ར་དང་། བྱི་ལ་དང་། བྱི་བ་དང་། སྡིག་པ་དང་། སྲིན་གྱི་མེ་དང་། སྦྲུལ་གདུག་པ་དང་། རྒྱལ་པོ་དང་། ཆོམ་རྐུན་གྱི་འཇིགས་པ་རྣམས་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་སྟེ།
en: They will pass genuinely beyond dangers related to lions, tigers, snakes, bears, hyenas, leopards, dogs, foxes, sea monsters, crocodiles, alligators, wildcats, rats, scorpions, centipedes, venomous snakes, kings, and robbers.

source: དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འཇིགས་པ་བཅུ་པོ་དེ་དག་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་རོ། །
en: In this way, bodhisattva great beings who abide by the component of discipline will pass genuinely beyond these ten dangers.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་རྟེན་ནི་ཚུལ་ཁྲིམས་ཡིན་ཏེ།
en: “Son of noble family, discipline is the foundation of a buddha’s qualities.

source: བྱང་ཆུབ་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་གནས་སོ། །
en: The qualities of awakening and buddhahood have their basis in the component of discipline.

source: གང་ལ་ཚུལ་ཁྲིམས་ཡོད་པ་དེ་ལ་ནི་ཏིང་ངེ་འཛིན་འདི་ཡོད་དོ། །
en: Whoever has discipline also has absorption.

source: གང་ལ་ཚུལ་ཁྲིམས་ཡོད་པ་དེ་ལ་ནི་ཤེས་རབ་འདི་ཡོད་དོ། །
en: Whoever has discipline also has insight.

source: གང་ལ་ཚུལ་ཁྲིམས་ཡོད་པ་དེ་ལ་ནི་རྣམ་པར་གྲོལ་བ་འདི་ཡོད་དོ། །
en: Whoever has discipline also has liberation.

source: གང་ལ་ཚུལ་ཁྲིམས་ཡོད་པ་དེ་ལ་ནི་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་འདི་ཡོད་དོ། །
en: Whoever has discipline also has perceived the wisdom of liberation.

source: རིགས་ཀྱི་བུ་དེ་ལ་གང་ཉོན་མོངས་པ་རྣམས་རབ་ཏུ་ཞི་བའི་ཚུལ་ཁྲིམས་ནི་གང་ཡིན།
en: “Son of noble family, what is the discipline that pacifies the afflictions?

source: ཅིའི་ཕྱིར་ན་ཉོན་མོངས་པ་རྣམས་ཞེས་བྱ་ཞེ་ན།
en: And why are the afflictions so called?

source: ཉོན་མོངས་པར་བྱེད་པས་ན་ཉོན་མོངས་པ་རྣམས་ཏེ། འདི་ལྟར་ཁམས་གསུམ་དུ་སེམས་ཅན་རྣམས་ཉོན་མོངས་པར་བྱེད་པས་ན་ཉོན་མོངས་པ་རྣམས་ཞེས་བྱའོ། །
en: Because of the way they afflict, and since they afflict beings in the three realms in this way, they are called afflictions.

source: དེ་དག་ཞི་བར་བྱེད་པ་གང་ཞེ་ན།
en: What, then, constitutes their pacification?

source: གང་རྟོག་པ་མེད་པ་དང་། རྣམ་པར་རྟོག་པ་མེད་པ་དང་། ཡོངས་སུ་རྟོག་པ་མེད་པ་དང་། རྒྱུ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། ཀུན་ཏུ་རྟོག་པ་མེད་པ་དང་། ཡིད་ལ་བྱེད་པ་མེད་པ་སྟེ།
en: When there is no thinking, no conceptualization, no imputation, no movement, no arising, no ideation, no mental involvement—

source: འདི་ནི་ཉོན་མོངས་པ་རྣམས་རྣམ་པར་ཞི་བ་ཞེས་བྱའོ། །
en: this is the pacification of the afflictions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སུ་དག་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བ་མི་ཤེས་པ་དེ་དག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ནི་ཡོངས་སུ་དག་པ་མ་ཡིན་ནོ། །
en: “Son of noble family, those bodhisattva great beings who do not know how to pacify the afflictions do not have a component of discipline that is utterly pure.

source: དེ་དག་ནི་ཚངས་པའི་འཇིག་རྟེན་དུ་སོང་ཡང་ཉོན་མོངས་པ་དང་བཅས་པར་ཟད་དོ། །
en: Because they might be able to end up in the realm of Brahmā, but still will be left with afflictions.

source: དེ་དག་ནི་སྲིད་པའི་རྩེ་མོར་སོང་ཡང་ཉོན་མོངས་པ་དང་བཅས་པར་ཟད་དོ། །
en: They might be able to end up at the summit of existence, but they still will be left with afflictions.

source: རིགས་ཀྱི་བུ་དེ་བས་ན་རྣམ་གྲངས་འདིས་ཀྱང་ཁྱོད་ཀྱིས་གང་ལ་ཁམས་གསུམ་པའི་ཉོན་མོངས་པ་རྣམས་མེད་པ་དེའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ནི་ཡོངས་སུ་དག་པ་ཡིན་པར་དེ་ལྟར་རིག་པར་བྱའོ། །
en: Therefore, son of noble family, you should understand through these descriptions that, in this way, anyone who is without the afflictions of the three realms also has a pure component of discipline.”

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་ཁམས་གསུམ་པའི་ཉོན་མོངས་པ་རྣམས་མ་མཆིས་པ་དེའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་དག་པ་ལགས་ན།
en: “Blessed One, if it is indeed the case that one who lacks the afflictions of the three realms has a pure component of discipline, then,

source: བཅོམ་ལྡན་འདས་ཉོན་མོངས་པ་དང་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཇི་ལྟར་ཁམས་གསུམ་པར་སྨོན་པར་བགྱིད།
en: Blessed One, how is it that a bodhisattva who is free of afflictions aspires to the three realms?”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཀུན་ནས་ཉོན་མོངས་པར་བྱ་བའི་ཕྱིར་ཁམས་གསུམ་པར་སྨོན་པར་མི་བྱེད་དེ།
en: “Son of noble family, bodhisattva great beings do not aspire to the three realms in order to become afflicted.

source: རིགས་ཀྱི་བུ་གང་དག་བདག་ཉིད་ཀྱང་ཉོན་མོངས་པ་མེད་ལ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཁམས་གསུམ་དུ་ཡང་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་ཡིན་ནོ། །
en: Son of noble family, certain beings who are not truly afflicted in their nature will nevertheless undergo the process of affliction in the three realms in order to bring beings to maturity; this is the bodhisattvas’ method.
